# SetupEnergySimulationDialog Methods (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
SetupEnergySimulationDialog Methods
SetupEnergySimulationDialog Class See Also
---
The SetupEnergySimulationDialog type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Show | Shows the SetupEnergySimulationDialog to the user as a modal dialog. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace